app/views/users/assign_role.html.erb

SELECT "roles".* FROM "roles"
---
    <%= form_for(@user, url: set_role_users_path(id: @user.id), html: { method: :put }) do |f| %>
      <%= f.select :role_id, Role.all.map{|l| [l.name, l.id]}, { include_blank: "Select Role" } %>