app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    @roles = Role.all

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @role = Role.find(params['id'])

INSERT INTO "roles" ("name", "created_at", "updated_at", "can_edit") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "only edit"], ["created_at", "2020-04-26 12:46:15.605585"], ["updated_at", "2020-04-26 12:46:15.605585"], ["can_edit", true]]
---
  def create
    @role = Role.new(role_params)
    if @role.save

UPDATE "roles" SET "can_create" = $1, "can_edit" = $2, "can_destroy" = $3, "updated_at" = $4 WHERE "roles"."id" = $5  [["can_create", true], ["can_edit", true], ["can_destroy", true], ["updated_at", "2020-04-26 11:47:35.823132"], ["id", 8]]
---
  def update
    if @role.update(role_params)

DELETE FROM "roles" WHERE "roles"."id" = $1  [["id", 5]]
---
  def destroy
    @role.destroy

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_role
      @role = Role.find(params[:id])