app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @student = Student.find(params['id'])

INSERT INTO "students" ("name", "phone", "marks", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "rahul"], ["phone", "1212121212"], ["marks", 20], ["created_at", "2020-04-26 12:39:55.720688"], ["updated_at", "2020-04-26 12:39:55.720688"]]
---
  def create
    @student = Student.new(student_params)
    if @student.save

UPDATE "students" SET "name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["name", "tesst 2"], ["updated_at", "2020-04-26 12:13:42.718566"], ["id", 2]]
---
  def update
    if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = $1  [["id", 2]]
---
  def destroy
    @student.destroy

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_student
      @student = Student.find(params[:id])