app/controllers/users_controller.rb

  def index
  	@users= User.where(admin: false)
---
SELECT "users".* FROM "users" WHERE "users"."admin" = $1  [["admin", false]]

  def assign_role
    @user = User.find(params['id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_role
    @user = User.find(params['id'])
    @user.update_attributes(role_id: params['user']['role_id'])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role_id", 5], ["updated_at", "2020-04-26 09:27:15.019876"], ["id", 1]]