app/models/user.rb

  def edit?
    return self.role.can_edit if role_id.present?
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create?
    return self.role.can_create if role_id.present?
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]