app/views/layouts/_header.html.erb

      <%if !current_user.admin? %>
        <div style="font-size: x-large;color: aliceblue;">Your Role is <%= current_user.role.present? ? current_user.role? : "not assigned yet"%></div>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]